**Find Unique Values in a Pandas DataFrame**

https://chrisalbon.com/python/data_wrangling/pandas_find_unique_values/

In [2]:
import pandas as pd
import numpy as np

**Create DataFrame**

In [3]:
raw_data = {'regiment': ['51st', '29th', '2nd', '19th', '12th', '101st', '90th', '30th', '193th', '1st', '94th', '91th'], 
            'trucks': ['MAZ-7310', np.nan, 'MAZ-7310', 'MAZ-7310', 'Tatra 810', 'Tatra 810', 'Tatra 810', 'Tatra 810', 'ZIS-150', 'Tatra 810', 'ZIS-150', 'ZIS-150'],
            'tanks': ['Merkava Mark 4', 'Merkava Mark 4', 'Merkava Mark 4', 'Leopard 2A6M', 'Leopard 2A6M', 'Leopard 2A6M', 'Arjun MBT', 'Leopard 2A6M', 'Arjun MBT', 'Arjun MBT', 'Arjun MBT', 'Arjun MBT'],
            'aircraft': ['none', 'none', 'none', 'Harbin Z-9', 'Harbin Z-9', 'none', 'Harbin Z-9', 'SH-60B Seahawk', 'SH-60B Seahawk', 'SH-60B Seahawk', 'SH-60B Seahawk', 'SH-60B Seahawk']}

df = pd.DataFrame(raw_data, columns = ['regiment', 'trucks', 'tanks', 'aircraft'])
df

   regiment     trucks           tanks        aircraft
0      51st   MAZ-7310  Merkava Mark 4            none
1      29th        NaN  Merkava Mark 4            none
2       2nd   MAZ-7310  Merkava Mark 4            none
3      19th   MAZ-7310    Leopard 2A6M      Harbin Z-9
4      12th  Tatra 810    Leopard 2A6M      Harbin Z-9
5     101st  Tatra 810    Leopard 2A6M            none
6      90th  Tatra 810       Arjun MBT      Harbin Z-9
7      30th  Tatra 810    Leopard 2A6M  SH-60B Seahawk
8     193th    ZIS-150       Arjun MBT  SH-60B Seahawk
9       1st  Tatra 810       Arjun MBT  SH-60B Seahawk
10     94th    ZIS-150       Arjun MBT  SH-60B Seahawk
11     91th    ZIS-150       Arjun MBT  SH-60B Seahawk

**Create a List of Unique Values by turning the pandas column into a set**

In [4]:
list(set(df['trucks']))

[nan, 'MAZ-7310', 'Tatra 810', 'ZIS-150']

**Create a List of Unique Values by using the unique() function**

In [5]:
list(df['trucks'].unique())

['MAZ-7310', nan, 'Tatra 810', 'ZIS-150']

In [6]:
df.trucks.unique()

array(['MAZ-7310', nan, 'Tatra 810', 'ZIS-150'], dtype=object)